# Задача 1.
# Вручную создать текстовый файл с данными (например, марка авто, модель авто, расход топлива, стоимость).
# *********************************************************************************************************************

with open('cars_info_txt.txt', 'w') as cars:
    cars.write("Марка авто     Модель авто     Расход топлива     Стоимость \n")
    cars.write("Toyota         Land Cruiser    25 л 100 км        4 000 000 руб. \n")
    cars.write("Nissan         Xtrail          15 л 100 км        3 000 000 руб. \n")

print()
print('Задача 1.')
print('Содержимое файла cars_info_txt.txt :')
print()

with open('cars_info_txt.txt', 'r') as cars:
    for line in cars:
        print(line)
# *********************************************************************************************************************
# Задача 2.
# Создать doc шаблон, где будут использованы данные параметры.
# *********************************************************************************************************************

# *********************************************************************************************************************
# Задача 3.
# Автоматически сгенерировать отчет о машине в формате doc (как в видео 7.2).
# *********************************************************************************************************************


# *********************************************************************************************************************
# Задача 4.
# Создать csv файл с данными о машине.
# *********************************************************************************************************************


# *********************************************************************************************************************
# Задача 5.
# Создать json файл с данными о машине.
# *********************************************************************************************************************